# 성별
SEX_CODES = {
    1: '남성',
    2: '여성'
}

# 연령대
AGE_CODES = {
    1: '15~19세',
    2: '20대',
    3: '30대',
    4: '40대',
    5: '50대',
    6: '60대 이상'
}


# 본인 포함 여행 인원수
GROUP_CODES = {
    1: '1명',
    2: '2명',
    3: '3명 이상'
}


# 여행 테마
THEME_CODES = {
    1: '식도락(음식/미식) 관광',
    2: '쇼핑',
    3: '자연경관 감상',
    4: '휴양/휴식(웰니스)',
    5: '고궁/역사 유적지 방문',
    6: '전통문화 체험',
    7: '박물관·전시관 관람',
    8: 'K-POP·한류 콘텐츠 관광',
    9: '연극·뮤지컬·발레 등 공연 관람',
    10: '지역 축제 참여',
    11: '유흥·나이트라이프·카지노',
    12: '놀이공원·테마파크',
    13: '뷰티·미용 관광',
    14: '치료·건강검진',
    15: '스포츠·레포츠 관람',
    16: '스포츠·레포츠 참가',
    17: '기타'
}

# 희망 권역
AREA_OPTIONS = [
    '전체',
    '수도권',
    '지방'
]